#### SetLightOn Method

---

|  |
| --- |
| LightGroupManager Class   See Also |

Turns the given light on or off for rendering the given view depending on the bool argument

**Namespace:**   Autodesk.Revit.DB.Lighting
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public void SetLightOn( 	ElementId viewId, 	ElementId lightId, 	bool turnOn ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetLightOn ( _ 	viewId As ElementId, _ 	lightId As ElementId, _ 	turnOn As Boolean _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetLightOn( 	ElementId^ viewId,  	ElementId^ lightId,  	bool turnOn ) ``` |

#### Parameters

viewId
:   Type:  Autodesk.Revit.DB ElementId
     The Id of the view

lightId
:   Type:  Autodesk.Revit.DB ElementId
     The Id of the light to turn on or off

turnOn
:   Type:  System Boolean
     Turns the light on if true, off if false

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The given element Id does not correspond to a 3d view -or- The given element Id does not correspond to a light instance |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

LightGroupManager Class

Autodesk.Revit.DB.Lighting Namespace